In [1]:
import pandas as pd

In [ ]:
import sys,os
sys.path.append("../scripts/")
from data_extraction import DataFrameManipulator

In [11]:
city_chart  = pd.read_csv('../youtube_data/Cities/Chart data.csv')

In [12]:
city_chart.head(10)

         Date                                 Cities    City name  Views
0  2020-06-28  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
1  2020-06-29  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
2  2020-06-30  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
3  2020-07-01  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
4  2020-07-02  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
5  2020-07-03  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
6  2020-07-04  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
7  2020-07-05  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
8  2020-07-06  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
9  2020-07-07  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0

In [13]:
city_chart.shape

(6395, 4)

In [8]:
new_column_names = {'Cities': 'city_id', 'City name': 'city_name','Date':'date'}

In [9]:
city_chart  = rename_columns(city_chart,new_column_names)

In [10]:
city_chart.head()

         date                                city_id    city_name  Views
0  2020-06-28  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
1  2020-06-29  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
2  2020-06-30  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
3  2020-07-01  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
4  2020-07-02  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0

In [14]:
city_chart.to_csv('../data/city_chart',index=False)

In [33]:
city_table = pd.read_csv('../youtube_data/Cities/Table data.csv')

In [15]:
city_table.head()

,Cities,City name,Geography,Geography.1,Views,Watch time (hours),Average view duration
0,Total,NaN,NaN,NaN,26625,2157.3497,0:04:51
1,0x164b85cef5ab402d:0x8467b6b037a24d49,Addis Ababa,ET,ET-AA,1252,127.5042,0:06:06
2,0x487a4d4c5226f5db:0xd9be143804fe6baa,Manchester,GB,GB-ENG,23,0.0402,0:00:06
3,0x3568eb6de823cd35:0x35d8cb74247108a7,Busan,KR,KR-26,14,0.0354,0:00:09
4,0x168e8fde9837cabf:0x191f55de7e67db40,Khartoum,SD,SD-KH,12,1.2627,0:06:18

In [16]:
new_column_names = {'Cities': 'city_id','City name': 'city_name','Geography': 'country_code'}

In [17]:
data_ext = DataFrameManipulator(city_table)

In [21]:
city_table   = data_ext.rename_columns(city_table,new_column_names)

In [26]:
rows_to_drop_by_number = [0]
city_table = data_ext.drop_rows(city_table, rows_to_drop_by_number, by_index=False)

In [28]:
city_table.head()

                                 city_id    city_name country_code
0                                  Total          NaN          NaN
1  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa           ET
2  0x487a4d4c5226f5db:0xd9be143804fe6baa   Manchester           GB
3  0x3568eb6de823cd35:0x35d8cb74247108a7        Busan           KR
4  0x168e8fde9837cabf:0x191f55de7e67db40     Khartoum           SD

In [30]:
city_table.to_csv('../data/city_table',index=False)

In [34]:
common_table = pd.read_csv('../youtube_data/Cities/Totals.csv')

In [35]:
common_table.head()

         date  views
0  2020-06-28      1
1  2020-06-29     72
2  2020-06-30     76
3  2020-07-01     70
4  2020-07-02     57

In [36]:
common_table.to_csv('../data/common_table',index=False)

In [38]:
country_code = pd.read_csv('../youtube_data/Geography/Chart data.csv')

In [39]:
country_code.head()

         Date Geography  Views
0  2020-06-28        BJ      0
1  2020-06-29        BJ      0
2  2020-06-30        BJ      0
3  2020-07-01        BJ      0
4  2020-07-02        BJ      0

In [ ]:
country_code.to_csv('../data/country_code',index=False)

In [40]:
device_chart = pd.read_csv('../youtube_data/Device type/Chart data.csv')

In [41]:
device_chart.head()

         Date Device type  Views
0  2020-06-28    Computer      1
1  2020-06-29    Computer     49
2  2020-06-30    Computer     62
3  2020-07-01    Computer     46
4  2020-07-02    Computer     29

In [42]:
device_chart.to_csv('../data/device_chart',index=False)

In [46]:
sharing_service = pd.read_csv('../youtube_data/Sharing service/Chart data.csv')

In [47]:
sharing_service.head()

         Date Sharing service  Shares
0  2020-06-28        Facebook       0
1  2020-06-29        Facebook       0
2  2020-06-30        Facebook       0
3  2020-07-01        Facebook       0
4  2020-07-02        Facebook       0

In [ ]:
data_ext = DataFrameManipulator(sharing_service)

In [48]:
new_column_names = {'Sharing service': 'sharing_service','Date': 'date'}

In [43]:
sharing_service  = data_ext.rename_columns(sharing_service,new_column_names)

In [44]:
sharing_service.head()

         date sharing_service  Shares
0  2020-06-28        Facebook       0
1  2020-06-29        Facebook       0
2  2020-06-30        Facebook       0
3  2020-07-01        Facebook       0
4  2020-07-02        Facebook       0

In [49]:
sharing_service.to_csv('../data/sharing_service',index=False)